Autodesk.Revit.DB.TableView.GetAvailableParameters(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Gets a list of valid parameters for the specified category that can be used in the table view.
cda:
The document.
categoryId:
The specified element category id.
Returns:
The IDs of all valid parameters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null

Autodesk.Revit.DB.TableView.TargetId
the element id of the element that is being viewed
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was null